export const tagRegex = /(<([^>]+)>)/ig;
export const intRegex = /\D/g;

export const effectOptions = [
    "쐐기",
    "망치",
    "순환",
    "열정",
    "냉정",
    "비수",
    "약점 노출",
    "우월",
    "습격",
    "정밀",
    "기습",
    "결투",
    "돌진",
    "마나회수",
    "깨달음",
    "응원"
]

export const jobBooks = [
    "광기", "광전사의 비기",
    "전투 태세", "고독한 기사",
    "분노의 망치", "중력 수련",
    "심판자", "축복의 오라",
    "오의 강화", "초심",
    "충격 단련", "극의: 체술",
    "세맥타통", "역천지체",
    "절정", "절제",
    "일격필살", "오의난무",
    "강화 무기", "핸드거너",
    "화력 강화", "포격 강화",
    "두 번째 동료", "죽음의 습격",
    "아르데타인의 기술", "진화의 유산",
    "사냥의 시간", "피스메이커",
    "진실된 용맹", "절실한 구원",
    "상급 소환사", "넘치는 교감",
    "황후의 은총", "황제의 칙령",
    "점화", "환류",
    "잔재된 기운", "버스트",
    "멈출 수 없는 충동", "완벽한 억제",
    "갈증", "달의 소리",
    "만개", "회귀",
    "이슬비", "질풍노도"
]